{
  "Users": [
    {
      "Id": 1,
      "Username": "bob",
      "Password": "bob"
    },
    {
      "Id": 2,
      "Username": "John",
      "Password": "John"
    },
    {
      "Id": 3,
      "Username": "Marcus",
      "Password": "1234"
    }
  ],
  "Posts": [
    {
      "Id": 1,
      "User": {
        "Id": 2,
        "Username": "John",
        "Password": "John"
      },
      "Title": "My first post",
      "Body": "Hello everyone!"
    },
    {
      "Id": 2,
      "User": {
        "Id": 2,
        "Username": "John",
        "Password": "John"
      },
      "Title": "My second post!",
      "Body": "Hi again!   Already two posts!!!"
    },
    {
      "Id": 3,
      "User": {
        "Id": 1,
        "Username": "bob",
        "Password": "bob"
      },
      "Title": "Hello",
      "Body": "Hey"
    },
    {
      "Id": 4,
      "User": {
        "Id": 1,
        "Username": "bob",
        "Password": "bob"
      },
      "Title": "How long can a title be I wonder? Lets try making this title very long by adding pointless useless text to see how long it can get!",
      "Body": "That is a very long title"
    },
    {
      "Id": 5,
      "User": {
        "Id": 2,
        "Username": "John",
        "Password": "John"
      },
      "Title": "Very Important!",
      "Body": "More than 100 stealth egg attacks baffle one Euclid homeowner and police (photos and video) EUCLID, Ohio -- An 85-year-old Euclid man\u0027s home has become the target of mysterious egging attacks that began in March 2014 and haven\u0027t stopped. The continuous onslaught of eggs has baffled police, neighbors and local government officials who have tried and failed to identify the source of the attacks that have ruined the man\u0027s home and kept his family on edge. \u0022The accuracy is phenomenal,\u0022 Albert Clemens, Sr. said. \u0022Because almost every time when it\u0027s nice weather and they launch five or six of these at a time, they almost invariably hit the front door.\u0022 Clemens green two-story house sits on the corner of Wilmore Avenue and East 210th Street. He and his wife bought the home as newlyweds about 60 years ago. Though his wife has since passed away, Clemens still lives there with his 49-year-old daughter and 51-year-old son. The house has been pelted with eggs several times a week -- sometimes more than once a day -- for the past year. The attacks always happen after dark and last around 10 minutes each. The family has been awoken as late as 2 a.m. by what sounds like the crack of a gunshot against the aluminum siding or front door. Clemens and police believe the eggs are being launched from a block or two away. The siding on the front of Clemens\u0027 home is destroyed, splattered with dried egg residue that stripped off the paint. Other than a few rogue eggs that hit nearby homes, no other neighbors have been targeted. \u0022Somebody is deeply, deeply angry at somebody in that household for some reason,\u0022 Euclid Lt. Mitch Houser said. Winter offered a short respite for the family, as the egging became less frequent during the cold weather. But both Clemens and police anticipate the attacks picking back up as the snow and ice thaw. An unsolved mystery Euclid police have not taken the investigation lightly. They\u0027ve spent a year doing undercover stakeouts, canvassing the neighborhood and even sending eggshells for testing. The department\u0027s entire community policing unit was dedicated to tracking down the eggers at one point. Officers respond quickly to every egging call at the home -- which is less than a mile from the police station. Both Clemens and detectives are at a dead end when it comes to suspects. Clemens had suspicions about a young man across the street who confronted him a couple years ago and asked him to stop calling police about suspicious activity in the neighborhood. Clemens said that he had started calling police more often as he noticed more crime -- mostly suspected drug activity. Another neighbor Clemens suspected was ruled out when officers saw him standing outside as an attack occurred in the presence of police. Investigators have taken several different approaches to nabbing the eggers, including installing a surveillance camera on the house. Detectives even collected some eggshell samples and tested them in a crime lab. The eggs were traced back to a local Amish farm, but the trail ended there. Clemens says the culprits either have access to a large supply of eggs or are stealing them from businesses that throw them out when they go bad. Detectives have followed this thread, visiting local restaurants and businesses asking about missing eggs. They\u0027ve also tried collecting fingerprints from eggshells, but Houser said that\u0027s an impossible task. When an egg breaks, it releases proteins that destroy DNA. Officers have gone door to door questioning neighbors and handing out fliers. Nobody has come forward with any tips. \u0022The person or people who are doing it have remained very tight-lipped apparently,\u0022 Houser said. \u0022I would imagine it would be hard to keep a secret of something that had been done hundreds of times and for nobody to step forward to talk about it.\u0022 The guilty parties don\u0027t appear to be intimidated by police interest in the case. An officer last year was taking a report when a barrage of eggs was launched at the house. One hit him in the foot. Houser said he\u0027s never seen this level of vandalism in his 20 years of police work. It\u0027s frustrated the whole department, which has dedicated hundreds of hours toward solving the egging mystery. \u0022The man hours put into that investigation were huge and one of the reasons it\u0027s so frustrating that we don\u0027t have somebody right now that we can criminally charge,\u0022 Houser said. The culprits will face charges of felony vandalism and criminal damaging, Houser said. Additional charges could be tacked on if investigators find evidence that the attacks are a hate crime. The search continues Clemens is waiting until the perpetrators are caught before he repairs the tarnished siding. His insurance company is refusing to settle a claim until the guilty party is found. He said he used to clean up after each attack, but it became so frequent that he couldn\u0027t keep up. Police initially offered a $500 reward for information, but bumped it up to $1,000 after nobody came forward. That money is still up for grabs. \u0022We\u0027re not going to let it go,\u0022 Houser said. \u0022We\u0027ll continue to put effort into it until we figure something out.\u0022 Despite all the torment, Clemens said he\u0027d never consider moving from his beloved home. \u0022I like the neighborhood,\u0022 Clemens said. \u0022I like the city of Euclid. I would live and die in this house -- but it\u0027s been kind of a nightmare.\u0022"
    },
    {
      "Id": 6,
      "User": {
        "Id": 3,
        "Username": "Marcus",
        "Password": "1234"
      },
      "Title": "Hello everyone!",
      "Body": "This is my first post"
    },
    {
      "Id": 7,
      "User": {
        "Id": 3,
        "Username": "Marcus",
        "Password": "1234"
      },
      "Title": "Title of my post!",
      "Body": "Hello everyone!!!"
    }
  ]
}